content/index.org
#+TITLE: Emacs literate configuration
#+PROPERTY: header-args :tangle ../init.el
#+OPTIONS: toc:2 num:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+HTML_HEAD: <meta name="google-site-verification" content="UnH0G3uduefQ6n9JV-YfihFU5SrKCWPHlvu6Ancvghs" />

* A foreword on this config and Lisp

Welcome to my literate [[https://github.com/Panadestein/emacsd][Emacs configuration]]. As many specimens of the pedigree,
this config ratifies that Newtonian aphorism involving giants. Many thanks to all the unsung
heroes whose Emacs Lisp snippets assemble the DNA of this file. Apropos of Lisp, I have
recently had a glimpse of the enlightenment promised by so many hacker's lore. Here is one
of my favorites, written by RMS: 

#+BEGIN_VERSE
In days long ago,
When clocks were so slow,
These basic keystrokes
Took too long for folks,
Unless they were writ
In C code to flit.
Today that's not so,
In Lisp they can go.
#+END_VERSE

** Org-mode literate programming

The beauty of literate configuration with org-mode is that it allows for maintaining an Emacs
config, a website, and an org-mode markup file at the same time. For example, in the header
of this file you can find the following code:

#+begin_src org-mode :tangle no
#+TITLE: Emacs literate configuration
#+PROPERTY: header-args :tangle ../init.el
#+OPTIONS: toc:2 num:nil
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+end_src

With these options, I tangle (every time I save, see the org-mode [[sec:org][hook]]) the source code blocks
in this config to my Emacs =init.el=, and I set up the ReadTheOrg theme that the website uses.
Another important aspect is the syntax highlighting when using Emacs in batch mode, which be
challenging without the proper configuration. The following code block does the trick:

#+bind: org-html-htmlize-output-type css
#+BEGIN_SRC emacs-lisp :var css-file="code.css" :tangle no :results raw
  (unless noninteractive
    (org-html-htmlize-generate-css)
    (with-current-buffer "*html*"
      (write-file css-file))
    (format "#+html_head_extra: <link rel=\"stylesheet\" type=\"text/css\" href=\"%s\"/>"
        css-file))
#+END_SRC

** Automatic configuration with Nix

Although it is possible to [[https://nixos.org/manual/nixos/stable/index.html#module-services-emacs][configure Emacs with Nix]], I prefer to use the Elisp configuration. However, I do use
the following overlay, together with [[https://app.cachix.org/cache/nix-community][Cachix]] to have the latest commits of the Emacs' master branch:

#+begin_src nix :tangle no
  nixpkgs.overlays = [
    # Emacs overlay
    (import (builtins.fetchTarball {
      url = https://github.com/nix-community/emacs-overlay/archive/master.tar.gz;
    }))
  ];

  environment.systemPackages = with pkgs; [
    emacsGitNativeComp
  ];
#+end_src

The latter is version controlled with git and can be [[https://github.com/Panadestein/nixos-config][automatically]] set up with =home-manager= like this: 

#+begin_src nix :tangle no
# Emacs configuration
home.file.".emacs.d/" = {
  source = pkgs.fetchFromGitHub {
    owner = "Panadestein";
    repo = "emacsd";
    rev = "abd98c10e5dc66756a678096c7d7564e1435ea01";
    sha256 = "0ppkvz6dkmgc774q0g7i6jjja1683gja3068kif3mrwn242gfaj5";
  };
  recursive = true;
  onChange = builtins.readFile /etc/nixos/dotfiles/set_emacs.sh;
};
#+end_src

#+begin_src shell :tangle no
#!/usr/bin/env bash

cd "$HOME"/.emacs.d
mkdir -p ./lib ./snippets/irp-mode ./undo
emacs --batch --eval "(require 'org)" --eval '(org-babel-tangle-file "./content/index.org")'
#+end_src

* General configuration

** Add the GNU ELPA and MELPA archives, and then ensure use-package

#+begin_src emacs-lisp
  (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
         ("melpa" . "https://melpa.org/packages/"))
        package-quickstart t)

  (unless (and (fboundp 'package-installed-p)
         (package-installed-p 'use-package))
    (package-initialize)
    (package-refresh-contents)
    (package-install 'use-package))
#+end_src


** One editor to rule them all, one editor to find them

Here I use the =use-package= macro to keep all Emacs internal settings organized in one single block.
The variables have self-explanatory names, but I have added a few comments for the sake of clarity. 

#+begin_src emacs-lisp
  (use-package emacs
    :ensure nil
    :config
    ;; Emacs internal options
    (setq-default initial-scratch-message ";; Welcome Panadestein!!"
                  ring-bell-function #'ignore
                  user-full-name "Ramón L. Panadés-Barrueta, PhD"
                  inhibit-startup-screen t
                  custom-safe-themes t)
    (setq backup-directory-alist
          `(("." . ,(concat user-emacs-directory "backups"))))
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (show-paren-mode 1)
    (fringe-mode '(0 . 0))
    ;; Make ESC close prompts
    (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
    ;; No scroll bar, always full screen
    (add-to-list 'default-frame-alist
                 '(vertical-scroll-bars . nil))
    (add-to-list 'default-frame-alist '(fullscreen . maximized))
    ;; Font
    (add-to-list 'default-frame-alist '(font . "Fira Code-18"))
    ;; Terminal transparency
    (face-spec-set 'default
                   '((((type tty)) :background "unspecified-bg")))
    ;; Line numbers
    (when (version<= "26.0.50" emacs-version)
      (global-display-line-numbers-mode)
      (setq display-line-numbers 'relative))
    ;; Remember line number
    (if (fboundp #'save-place-mode)
        (save-place-mode +1)
      (setq-default save-place t)))
#+end_src

** Prevent custom from messing with my config file

This helps to clear the clutter and increases reproducibility of the config

#+begin_src emacs-lisp
  (let
      ((customization-file (expand-file-name "custom.el" user-emacs-directory)))
    (when (file-exists-p customization-file)
      (setq custom-file customization-file)
      (load custom-file 'noerror)))
#+end_src

** Only highlight programming and text buffers

#+begin_src emacs-lisp
  (use-package hl-line
    :config
    (global-hl-line-mode +1)
    :hook
    (prog-mode . hl-line-mode)
    (text-mode . hl-line-mode))
#+end_src

** Old habits die hard

I cannot just trash years of Vim muscle memory workout. Although the Emacs keybindings
slowly start to /klappt/.

#+begin_src emacs-lisp
  (use-package evil
    :ensure t
    :demand t
    :config
    (evil-mode 1)
    (evil-set-undo-system 'undo-tree)
    ;; This is the cleanest solution for vterm
    (evil-set-initial-state 'eshell-mode 'emacs)
    (evil-set-initial-state 'vterm-mode 'emacs))
#+end_src

** Linear undo system

This is one of the not so awesome quirks of Emacs IMHO. Maybe one day I will understand
its power. I keep it linear for the moment.

#+begin_src emacs-lisp
  (use-package undo-tree
    :ensure t
    :init
    (global-undo-tree-mode)
    :config
    (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo"))))
#+end_src

** Themes

As Nietzsche said, the voice of beauty speaks softly; it creeps only into the most fully awakened souls.
Ergo the importance of a visually pleasant editor. These are my top three themes:

#+begin_src emacs-lisp
  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t
          doom-themes-enable-italic t)
    (load-theme 'doom-vibrant t)
    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-atom")
    (setq doom-themes-treemacs-enable-variable-pitch nil)
    (doom-themes-treemacs-config)
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

  (use-package gruvbox-theme
    :ensure t
    :disabled
    :init (load-theme 'gruvbox-dark-soft t))
  
  (use-package blackboard-theme
    :ensure t
    :disabled
    :init (load-theme 'blackboard t))

  ;; Highlight numbers

  (use-package highlight-numbers
    :ensure t
    :hook
    (prog-mode . highlight-numbers-mode))
#+end_src

** Handle very long lines

Another well-known issue of Emacs, although it rarely affects me.

#+begin_src emacs-lisp
  (use-package so-long
    :ensure nil
    :hook
    (after-init-hook . global-so-long-mode))
#+end_src

** Improved parentheses

This helps a lot when lisping.

#+begin_src emacs-lisp
  (use-package smartparens
    :ensure t
    :hook (prog-mode . smartparens-mode))
#+end_src

** Highlight parentheses with different color

Another eye candy. Parenthesis of different colors are very helpful in Lisp though.

#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Minimap

This package implements Sublime Text's minimap in Emacs. Although I am quasi-satisfied with
this config, I am not ready to use it on a regular basis.

#+begin_src emacs-lisp
  (use-package minimap
    :ensure t
    :config
    (setq minimap-window-location 'right)
    (setq minimap-minimum-width 10)
    (setq minimap-dedicated-window t)
    (setq minimap-hide-cursor t)
    (setq minimap-hide-scroll-bar t)
    (setq minimap-hide-fringes t))
#+end_src

** Fancy mode line

Another gift from the Doom Emacs community. Best modeline I have seen for Emacs.
The additional package =all-the-icons= provides awesome icons not only for the
modeline, but also for file managers and many other packages.

#+begin_src emacs-lisp
  (use-package all-the-icons
    ;; Needs a manual `M-x all-the-icons-install-fonts`
    :ensure t)

  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :config
    (setq doom-modeline-height 40)
    (setq doom-modeline-buffer-file-name-style 'relative-to-project)
    (setq doom-line-numbers-style 'relative)
    (setq doom-modeline-major-mode-icon t)
    (setq doom-modeline-buffer-state-icon t)
    (setq doom-modeline-major-mode-color-icon t))
#+end_src

** Multiple cursors support

This package is very interesting, although not so ergonomic IMHO. Here are some of the
most relevant commands:

- =C-n= make and go to next match
- =C-p= make and go to previous match
- =g r q= stop all cursors

#+begin_src emacs-lisp
  (use-package evil-mc
    :ensure t
    :config
    (global-evil-mc-mode 1))
#+end_src

** Tabs-bar-mode
I could not manage to use this package without side effects in Evil-mode. Here is a simple
usage:

- =C-x t f "filename"= opens file in new tab
- =C-x t 0= closes current tab

#+begin_src emacs-lisp
  (use-package tabbar
    :ensure t
    :bind (("C-<right>" . tabbar-forward)))
#+end_src

** Fancy HTML exports

This package ensures that some =org-mode= babel exports have proper syntax highlighting.

#+begin_src emacs-lisp
  (use-package htmlize
    :ensure t)
#+end_src

* IDE features and help

** Complete everything (but code) in Emacs with ivy

The usage of ivy and their autocompletion army (swiper, counsel) has greatly increased my
productivity. It is also very well integrated with the Doom Emacs theme I use. The swiper
search feature (=C-s=) is far more powerful than the default Emacs counterpart. 

#+begin_src emacs-lisp
  (use-package ivy
    :ensure t
    :diminish
    :bind
    (("C-s" . swiper))
    :config
    (setq ivy-use-virtual-buffers t)
    (ivy-mode 1))

  (use-package swiper
    :ensure t)

  (use-package counsel
    :ensure t
    :after ivy
    :hook
    (after-init . counsel-mode)
    :config (counsel-mode)
    :bind
    ("M-x" . counsel-M-x)
    ("C-x b" . counsel-ibuffer)
    ("C-M-l" . counsel-imenu)
    ("C-x C-f" . counsel-find-file)
    ("<f1> v" . counsel-describe-variable)
    ("<f1> f" . counsel-descbinds-function))
  
  (use-package ivy-prescient
    :ensure t
    :after counsel
    :config
    (ivy-prescient-mode 1))

  (use-package ivy-rich
    :ensure t
    :init
    (ivy-rich-mode 1)
    :after counsel
    :config
    (setq ivy-format-function #'ivy-format-function-line)
    (setq ivy-rich-display-transformers-list
          (plist-put ivy-rich-display-transformers-list
                     'ivy-switch-buffer
                     '(:columns
                       ((ivy-rich-candidate (:width 40))
                        (ivy-rich-switch-buffer-indicators
                         (:width 4 :face error :align right))
                        (ivy-rich-switch-buffer-major-mode
                         (:width 12 :face warning))
                        (ivy-rich-switch-buffer-project
                         (:width 15 :face success))
                        (ivy-rich-switch-buffer-path
                         (:width (lambda (x) (ivy-rich-switch-buffer-shorten-path
                                              x (ivy-rich-minibuffer-width 0.3))))))))))

  (use-package all-the-icons-ivy
    :ensure t
    :demand t)
#+end_src

** Command's information with which-key

Which-key is a must-have to sail the raging seas of Emacs' packages keybindings. These suggestions
come very handy when exploring a new package.

#+begin_src emacs-lisp
  (use-package which-key
    :ensure t
    :diminish
    :custom
    (which-key-idle-secondary-delay 0.01)
    (which-key-dont-use-unicode t)
    :config
    (which-key-mode t))
#+end_src

** Improved help system with Helpful

Emacs default help system is very good. Helpful makes it awesome by adding colors and source code
exploration.

#+begin_src emacs-lisp
  (use-package helpful
    :ensure t
    :custom
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ("C-h f" . helpful-function)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-command] . helpful-command)
    ([remap describe-key] . helpful-key))
#+end_src

** Code tags

Using code tags when developing in large scale codes (like electronic structure packages)
can save your fingers from =grep= induced damage. I use the minimalistic =gtags-mode= that
relies as much as possible on already existing Emacs tools. I also have configured the =counsel-etags=
package, though its approach of parsing the TAGS file makes it very slow when used with TRAMP.

#+begin_src emacs-lisp
  (use-package gtags-mode
    :ensure t
    :hook ((emacs-startup . gtags-mode)))

  (use-package counsel-etags
    :ensure t
    :disabled
    :bind (("C-]" . counsel-etags-find-tag-at-point))
    :init
    (add-hook 'prog-mode-hook
              (lambda ()
                (add-hook 'after-save-hook
                          'counsel-etags-virtual-update-tags 'append 'local)))
    :config
    (setq counsel-etags-update-interval 60)
    (push "build" counsel-etags-ignore-directories))
#+end_src

** Completion with company

Source code completions. An all-time classic.

#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :init
    (add-hook 'after-init-hook 'global-company-mode)
    (setq company-minimum-prefix-length 3
          company-selection-wrap-around t
          company-tooltip-limit 20
          company-tooltip-minimum-width 15
          company-tooltip-align-annotations t))
#+end_src

