content/index.org
** Language serve protocol

Microsoft's Language Server Protocol ([[https://microsoft.github.io/language-server-protocol/][LSP]])
is a great tool to provide IDE features to Emacs. I use two major-modes for managing the lsp servers,
namely =lsp-mode= and =eglot=. The latter maximizes the use of already existing Emacs infrastructure,
and works better with TRAMP.

#+begin_src emacs-lisp
  (use-package lsp-mode
    :ensure t
    :config
    (setq lsp-idle-delay 0.5
          lsp-enable-symbol-highlighting t
          lsp-enable-snippet nil
          lsp-pyls-plugins-flake8-enabled t)
    (lsp-register-custom-settings
     '(("pyls.plugins.pyls_mypy.enabled" nil nil)
       ("pyls.plugins.pyls_mypy.live_mode" nil t)
       ("pyls.plugins.pyls_black.enabled" t t)
       ("pyls.plugins.pyls_isort.enabled" t t)
       ;; Disable duplicated by flake8
       ("pyls.plugins.pycodestyle.enabled" nil t)
       ("pyls.plugins.mccabe.enabled" nil t)
       ("pyls.plugins.pyflakes.enabled" nil t)))
    (lsp-register-client
       (make-lsp-client :new-connection (lsp-tramp-connection "<fortls>")
                        :major-modes '(f90-mode)
                        :remote? t
                        :server-id 'fortls-remote))
    (lsp-register-client
       (make-lsp-client :new-connection (lsp-tramp-connection "<pyls>")
                        :major-modes '(python-mode)
                        :remote? t
                        :server-id 'pyls-remote))
    :hook
    ((python-mode . lsp)
     (f90-mode . lsp)
     (lsp-mode . lsp-enable-which-key-integration)))

  (use-package lsp-ui
    :ensure t
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-sideline-show-hover t
          lsp-ui-sideline-delay 0.5
          lsp-ui-doc-delay 5
          lsp-ui-sideline-ignore-duplicates t
          lsp-ui-doc-position 'bottom
          lsp-ui-doc-alignment 'frame
          lsp-ui-doc-header nil
          lsp-ui-doc-include-signature t
          lsp-ui-doc-use-childframe t)
    :commands lsp-ui-mode)

    (use-package lsp-treemacs
      :after treemacs lsp
      :ensure t)

    (use-package eglot
      :ensure t
      :defer t
      :init
      (setq-default eglot-stay-out-of '(eldoc)))
#+end_src

** Spell checking with FlySpell

FlySpell does a lot out of the box, therefore I have a very basic config.

#+begin_src emacs-lisp
  (use-package flyspell
    :hook
    ((prog-mode . flyspell-prog-mode)
     (text-mode . turn-on-flyspell))
    :config
    (flyspell-mode +1))
#+end_src

** Grammar checking with LanguageTool

This is a free and open-source multilingual grammar checker that supports more than thirty languages.
A must-have if you write papers in LaTeX or org-mode. For the Emacs package to work one needs to install
the [[https://languagetool.org/][LanguageTool]] package, and start the HTTP server for example as a systemd unit.

#+begin_src emacs-lisp
  (use-package langtool
    :ensure t
    :init
    (setq langtool-http-server-host "localhost" 
          langtool-http-server-port 8081))
#+end_src

** Syntax checking with Flycheck

Flycheck is another helpful tool. It has some limitations though. For instance, the continuous
checking can harm performance, and some checkers can introduce huge penalties (I had to
disable =mypy=). With this config I only check when saving.

#+begin_src emacs-lisp
  (use-package flycheck
    :init
    (setq-default flycheck-disabled-checkers '(python-mypy))
    :config
    (setq flycheck-check-syntax-automatically '(save mode-enable))
    (setq flycheck-scheme-chicken-executable "csc")
    :hook
    (after-init . global-flycheck-mode))
#+end_src

** Snippets

Yasnippet is a fairly complete collection of snippets with a very intuitive syntax. Painful is the absence
of Scheme snippets. I have written some custom snippets for the IRPF90 derived mode, which I also include
here.

#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (yas-global-mode 1))

  (use-package yasnippet-snippets
    :ensure t
    :after yasnippet)
#+end_src

#+begin_src yasnippet :tangle ../snippets/irp-mode/irp_as
# -*- mode: snippet -*-
# name: ASSERT 
# key: ass
# --
ASSERT ($0)%
#+end_src

#+begin_src yasnippet :tangle ../snippets/irp-mode/irp_doc
# -*- mode: snippet -*-
# name: BEGIN_DOC ... END_DOC
# key: bc
# --
BEGIN_DOC
! $0
END_DOC%   
#+end_src

#+begin_src yasnippet :tangle ../snippets/irp-mode/irp_prov
# -*- mode: snippet -*-
# name: BEGIN_PROVIDER ... END_PROVIDER 
# key: bp
# --
BEGIN_PROVIDER [${1:integer}, ${2:var}]
    $0
END_PROVIDER%  
#+end_src

#+begin_src yasnippet :tangle ../snippets/irp-mode/irp_sh
# -*- mode: snippet -*-
# -*- mode: snippet -*-
# name: BEGIN_SHELL ... END_SHELL 
# key: bsh
# --
BEGIN_SHELL [ ${1:/bin/bash} ]
    $0
END_SHELL%  
#+end_src

* File browsing and terminals

** Terminal support with Vterm

This package uses a C library instead of Lisp to emulate the terminals. It is my favorite emulator
currently.

#+begin_src emacs-lisp
  (use-package vterm
    :ensure t
    :preface
    (defun my/vterm-mode-hook ()
      (hl-line-mode -1)
      (display-line-numbers-mode -1)
      (display-fill-column-indicator-mode -1)
      (auto-fill-mode -1))
    :hook
    ((vterm-mode . my/vterm-mode-hook))
    :custom
    (vterm-kill-buffer-on-exit t)
    (vterm-max-scrollback 10000)
    (vterm-tramp-shells '(("ssh" "/bin/bash")))
    :init
    (which-key-add-key-based-replacements "C-c t" "term")
    :config
    ;; Add find-file-other-window to accepted commands
    (add-to-list 'vterm-eval-cmds
                 '("find-file-other-window" find-file-other-window)))

  (use-package vterm-toggle
    :ensure t
    :bind (("C-`" . vterm-toggle-cd)
           :map vterm-mode-map
           (("<C-return>" . vterm-toggle-insert-cd)
            ("C-M-n" . vterm-toggle-forward)
            ("C-M-p" . vterm-toggle-backward)))
    :custom
    (vterm-toggle-scope 'project)
    (vterm-toggle-project-root t)
    (vterm-toggle-fullscreen-p nil)
    :config
    ;; Show at bottom
    (add-to-list 'display-buffer-alist
                 '((lambda(bufname _)
                     (with-current-buffer bufname
                       (equal major-mode 'vterm-mode)))
                   ;; (display-buffer-reuse-window display-buffer-at-bottom)
                   (display-buffer-reuse-window display-buffer-in-direction)
                   ;;display-buffer-in-direction/direction/dedicated is added in emacs27
                   (direction . bottom)
                   (dedicated . t) ;dedicated is supported in emacs27
                   (reusable-frames . visible)
                   (window-height . 0.3))))
#+end_src

** Terminal support with Eshell
This is a command shell written purely in Emacs Lisp. While not being POSIX compliant,
it is still a powerful tool for remote editing due to its native TRAMP support. Here I define
a custom prompt that resembles my Zsh one.

#+begin_src emacs-lisp
  (use-package eshell
    :ensure nil
    :preface
    (defun my-eshell-prompt ()
      "A nice prompt"
      (concat
        "(" (user-login-name) " . "
        (car (reverse (split-string (eshell/pwd) "/"))) ") "))
    :hook
    ((eshell-mode . (lambda () 
                      (add-to-list 'eshell-visual-commands "ssh")
                      (add-to-list 'eshell-visual-commands "tail")
                      (add-to-list 'eshell-visual-commands "top")
                      (eshell/alias "e" "find-file-other-window $1")
                      (eshell/alias "d" "dired-other-window $1") 
                      (eshell/alias "mgu" "magit-diff-unstaged")
                      (eshell/alias "mg" "magit-diff-staged"))))
    :custom
    (eshell-banner-message (shell-command-to-string "figlet Eshell"))
    (eshell-history-size 10000)
    (eshell-hist-ignore-dups t)
    (eshell-buffer-maximum-lines 10000)
    (eshell-scroll-to-bottom-on-input t)
    (eshell-destroy-buffer-when-process-dies t)
    (eshell-prompt-regexp "^[^\)]*[\)] ")
    (eshell-prompt-function #'my-eshell-prompt)
    :config
    (defun eshell/clear ()
    "Clear the eshell buffer."
      (let ((inhibit-read-only t))
        (erase-buffer)
        (eshell-send-input)))
    (setenv "PAGER" "cat"))
  
  (use-package eshell-toggle
    :custom
    (eshell-toggle-size-fraction 3)
    (eshell-toggle-use-projectile-root nil)
    (eshell-toggle-run-command nil)
    (eshell-toggle-init-function #'eshell-toggle-init-eshell)
    :bind
    ("C-c p" . eshell-toggle))
#+end_src

** File browsers

After trying a couple of file browsers I understood that all I needed was already there: =dired=.

#+begin_src emacs-lisp
  (use-package ranger
    :ensure t
    :disabled
    :config
    (setq ranger-preview-file t))

  (use-package neotree
    :ensure t
    :disabled
    :bind ("<f9>" . 'neotree-toggle)
    :init
    ;; slow rendering
    (setq inhibit-compacting-font-caches t)
    ;; set icons theme
    (setq neo-theme (if (display-graphic-p) 'icons 'arrow))
    (setq neo-smart-open t))

  (use-package treemacs
    :ensure t
    :defer t
    :bind
    (:map global-map
	        ("<f8>" . treemacs)))

  (use-package treemacs-evil
    :after (treemacs evil)
    :ensure t)
  
  (use-package treemacs-magit
    :after (treemacs magit)
    :ensure t)

  (use-package all-the-icons-dired
    :ensure t)

  (use-package dired
    ;; TIP: use ( to hide file information
    :ensure nil
    :custom ((dired-listing-switches "-agho --group-directories-first"))
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :hook
    (dired-mode . all-the-icons-dired-mode)
    :config
    (evil-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))

  (use-package dired-single
    :ensure t)
#+end_src

** PDF support

Another C Library, it works better than the default Emacs PDF viewer, for instance it allows hyperlinks.

#+begin_src emacs-lisp
  (use-package pdf-tools
    :ensure t
    ;:pin manual
    :config
    (setq-default pdf-view-display-size 'fit-page)
    (setq pdf-annot-activate-created-annotations t)
    (pdf-tools-install))
#+end_src

** TRAMP

Another must have of Emacs. This package together with dired saves me from configuring
my editor all the time in obscure supercomputers around the world.

#+begin_src emacs-lisp
  (use-package tramp
    :ensure nil
    :config
    (add-to-list 'tramp-remote-path 'tramp-own-remote-path))
#+end_src

* Programming

Here you can find my configuration for different programming languages. I will introduce it
in a laconic manner, because this section is rather opinionated.

** Lisp stuff

The language that gave birth to the "Maxwell equations of software".

#+begin_src emacs-lisp
  (use-package lispy
    :ensure t
    :hook ((emacs-lisp-mode . lispy-mode)
           (scheme-mode . lispy-mode)))

  (use-package slime
    :ensure t
    :mode ("\\.lisp\\'" . lisp-mode)
    :init
    (setq slime-net-coding-system 'utf-8-unix
          inferior-lisp-program "sbcl")
    (add-to-list 'slime-contribs 'slime-fancy)
    (add-to-list 'slime-contribs 'slime-repl))

  (use-package geiser
    :ensure t
    :config
    (setq geiser-active-implementations '(chicken)))

  (use-package geiser-chicken
    :ensure t
    :init
    (setq geiser-chicken-binary "csi"))

  (use-package racket-mode
    :ensure t)

  (use-package hy-mode
    :ensure t
    :mode "\\.hy\\'"
    :commands (hy-mode org-babel-execute:hy)
    :interpreter "hy"
    :hook
    (hy-mode . company-mode)
    (hy-mode . (lambda () (lispy-mode 1)))
    :config
    (add-hook 'hy-mode-hook #'paredit-mode)
    (add-hook 'hy-mode-hook #'rainbow-delimiters-mode))
#+end_src

Sometimes it is very useful to expand Emacs Lisp macros to better understand their functionality.
For this, the =macrostep= package comes very handy.

#+begin_src emacs-lisp
  (use-package macrostep
    :ensure t
    :bind (:map emacs-lisp-mode-map
                ("C-c e" . macrostep-expand)))
#+end_src

** FORTRAN stuff

FORTRAN is a major component of my job as a physicist, this package provides all I need. 

#+begin_src emacs-lisp
  (use-package f90-mode
    :mode ("\\.f90\\'")
    :hook
    (f90-mode . (lambda () (setq flycheck-gfortran-args "-ffree-form"))))
#+end_src

** IRPF90

[[http://irpf90.ups-tlse.fr/][IRPF90]] is an environment that allows for efficient functional programming in FORTRAN
using the Implicit Reference to Parameters (IRP) method. I have developed a derived
mode for IRPF90:

#+begin_src emacs-lisp :tangle ../lib/irp-mode.el
  ;;; irp-mode.el --- A major mode for dealing with IRPF90 files

  ;;; Commentary:
  ;; An attempt to support Scemama's IRPF90 in Emacs

  ;;; Code:

  ;; Define IRPF90 extended FORTRAN syntax

  (defvar irp-font-lock-keywords)

  (setq irp-font-lock-keywords
        (let* (
               ;; Define different keywords
               (x-keywords '("BEGIN_PROVIDER" "END_PROVIDER" "ASSERT"
                              "FREE" "PROVIDE" "BEGIN_TEMPLATE"
                              "END_TEMPLATE" "BEGIN_SHELL"
                              "END_SHELL" "IRP_IF" "IRP_ELSE" "TOUCH"
                              "SOFT_TOUCH"))
               (x-types '("double precision" "integer"))
               (x-comments '("BEGIN_DOC" "END_DOC"))

               ;; Generate regex
               (x-keywords-regexp (regexp-opt x-keywords 'words))
               (x-types-regexp (regexp-opt x-types 'words))
               (x-comments-regexp (regexp-opt x-comments 'words)))

          `(
            (,x-types-regexp . font-lock-type-face)
            (,x-keywords-regexp . font-lock-preprocessor-face)
            (,x-comments-regexp . font-lock-comment-face)
            )))

  ;;;###autoload
  (define-derived-mode irp-mode f90-mode "irp mode"
    "Major mode for editing IRPF90 files."
    :syntax-table nil
    :abbrev-table nil
    (font-lock-add-keywords nil irp-font-lock-keywords))

  (provide 'irp-mode)
  ;;; irp-mode.el ends here
#+end_src

This mode can be also configured with =use-package=:

#+begin_src emacs-lisp
  (use-package irp-mode
    :mode ("\\.irp.f\\'")
    :load-path "~/.emacs.d/lib")
#+end_src

** C/C++ stuff

#+begin_src emacs-lisp
  (use-package ccls
    :ensure t
    :hook ((c-mode c++-mode objc-mode cuda-mode) .
           (lambda () (require 'ccls) (lsp)))
    :config
    (setq c-basic-offset 6)
    (setq c-default-style '((java-mode . "java")
                            (awk-mode . "awk")
                            (other . "linux"))))
#+end_src

